experimental/glm52_b300_fixed_seq/results/c2-four-frontier-megamoe-refresh-20260921/regression-reference/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc8/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 80 --max-concurrency 8 --request-rate inf --ignore-eos --save-result --num-warmups 16 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc8 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.1WksJr ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.1WksJr -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-ad0a5e5e:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-mem80-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 80 --max-concurrency 8 --request-rate inf --ignore-eos --save-result --num-warmups 16 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc8 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=8, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=80, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-megamoe-mem80-20260920/1k1k/w4a16-megamoe/tp4_conc8', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=16)
Generating 80 prompts using 8 worker processes...
Prompt generation completed in 2.5s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=822   max=1024  mean=924.21   avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=929.08  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 16 requests...
100%|██████████| 16/16 [00:15<00:00,  1.02it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
  0%|          | 0/80 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 80/80 [01:31<00:00,  1.14s/it]
============ Serving Benchmark Result ============
Successful requests:                     80        
Benchmark duration (s):                  91.35     
Total input tokens:                      73937     
Total generated tokens:                  74326     
Request throughput (req/s):              0.88      
Output token throughput (tok/s):         813.64    
Total Token throughput (tok/s):          1623.02   
---------------Time to First Token----------------
Mean TTFT (ms):                          575.46    
Median TTFT (ms):                        273.80    
P90 TTFT (ms):                           1399.48   
P99 TTFT (ms):                           2665.05   
P99.9 TTFT (ms):                         3035.45   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.10      
Median TPOT (ms):                        9.11      
P90 TPOT (ms):                           10.14     
P99 TPOT (ms):                           10.99     
P99.9 TPOT (ms):                         11.23     
---------------Inter-token Latency----------------
Mean ITL (ms):                           760.78    
Median ITL (ms):                         538.02    
P90 ITL (ms):                            1608.77   
P99 ITL (ms):                            3240.01   
P99.9 ITL (ms):                          5499.51   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9020.10   
Median E2EL (ms):                        8940.48   
P90 E2EL (ms):                           10202.23  
P99 E2EL (ms):                           12086.99  
P99.9 E2EL (ms):                         12238.46  
==================================================
+ set +x